py32-rs/py32-data/svd/PY32F303xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC1</name>
      <description>desc DAC</description>
      <groupName>DAC</groupName>
      <baseAddress>0x40007400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFF1FFF</resetMask>
          <fields>
            <field>
              <name>EN1</name>
              <description>desc EN1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BOFF1</name>
              <description>desc BOFF1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEN1</name>
              <description>desc TEN1</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEL1</name>
              <description>desc TSEL1</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1</name>
              <description>desc WAVE1</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MAMP1</name>
              <description>desc MAMP1</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN1</name>
              <description>desc DMAEN1</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN2</name>
              <description>desc EN2</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BOFF2</name>
              <description>desc BOFF2</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEN2</name>
              <description>desc TEN2</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEL2</name>
              <description>desc TSEL2</description>
              <msb>21</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2</name>
              <description>desc WAVE2</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MAMP2</name>
              <description>desc MAMP2</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN2</name>
              <description>desc DMAEN2</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIGR</name>
          <description>desc SWTRIGR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SWTRIG1</name>
              <description>desc SWTRIG1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>SWTRIG2</name>
              <description>desc SWTRIG2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R1</name>
          <description>desc DHR12R1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L1</name>
          <description>desc DHR12L1</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FF8</resetMask>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <msb>14</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R1</name>
          <description>desc DHR8R1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R2</name>
          <description>desc DHR12R2</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L2</name>
          <description>desc DHR12L2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF0</resetMask>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <msb>15</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R2</name>
          <description>desc DHR8R2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12RD</name>
          <description>desc DHR12RD</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF0FFF</resetMask>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <msb>27</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12LD</name>
          <description>desc DHR12LD</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF0FFF0</resetMask>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <msb>15</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <msb>31</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8RD</name>
          <description>desc DHR8RD</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <description>desc DACC1DHR</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DACC2DHR</name>
              <description>desc DACC2DHR</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR1</name>
          <description>desc DOR1</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>DACC1DOR</name>
              <description>desc DACC1DOR</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR2</name>
          <description>desc DOR2</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>DACC2DOR</name>
              <description>desc DACC2DOR</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
