py32-rs/py32-data/svd/PY32F303xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>desc DBGMCU</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <description>desc IDCODE</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REV_ID</name>
              <description>desc REV_ID</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7E1FFFE7</resetMask>
          <fields>
            <field>
              <name>DBG_SLLEP</name>
              <description>desc DBG_SLLEP</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_STOP</name>
              <description>desc DBG_STOP</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_STDBY</name>
              <description>desc DBG_STDBY</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACE_IOEN</name>
              <description>desc TRACE_IOEN</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACE_MODE</name>
              <description>desc TRACE_MODE</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>desc DBG_IWDG_STOP</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <description>desc DBG_WWDG_STOP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM1_STOP</name>
              <description>desc DBG_TIM1_STOP</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM2_STOP</name>
              <description>desc DBG_TIM2_STOP</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM3_STOP</name>
              <description>desc DBG_TIM3_STOP</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM4_STOP</name>
              <description>desc DBG_TIM4_STOP</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_CAN_STOP</name>
              <description>desc DBG_CAN_STOP</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_I2C1_SMBUS_TIMEOUT</name>
              <description>desc DBG_I2C1_SMBUS_TIMEOUT</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_I2C2_SMBUS_TIMEOUT</name>
              <description>desc DBG_I2C2_SMBUS_TIMEOUT</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM8_STOP</name>
              <description>desc DBG_TIM8_STOP</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM5_STOP</name>
              <description>desc DBG_TIM5_STOP</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM6_STOP</name>
              <description>desc DBG_TIM6_STOP</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM7_STOP</name>
              <description>desc DBG_TIM7_STOP</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM12_STOP</name>
              <description>desc DBG_TIM12_STOP</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM13_STOP</name>
              <description>desc DBG_TIM13_STOP</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM14_STOP</name>
              <description>desc DBG_TIM14_STOP</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM9_STOP</name>
              <description>desc DBG_TIM9_STOP</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM10_STOP</name>
              <description>desc DBG_TIM10_STOP</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_TIM11_STOP</name>
              <description>desc DBG_TIM11_STOP</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
