py32-rs/py32-data/svd/PY32F303xx.svd
        <register>
          <name>XSOCR</name>
          <description>desc XSOCR</description>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x02</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SPIMODE</name>
              <description>desc SPIMODE</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SENM</name>
              <description>desc SENM</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTICMD</name>
              <description>desc MULTICMD</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MULTIADDR</name>
              <description>desc MULTIADDR</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DDRCMD</name>
              <description>desc DDRCMD</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DDRADDR</name>
              <description>desc DDRADDR</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DDRDATA</name>
              <description>desc DDRDATA</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XDCR</name>
          <description>desc DCR</description>
          <addressOffset>0x1E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>XDUMMY</name>
              <description>desc XDUMMY</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>NOADDR</name>
              <description>desc NOADDR</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>NOCMD</name>
              <description>desc NOCMD</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>REC</name>
              <description>desc REC</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XCR3</name>
          <description>desc XCR3</description>
          <addressOffset>0x1F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>ADDR8BIT</name>
              <description>desc ADDR8BIT</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR16BIT</name>
              <description>desc ADDR16BIT</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR32BIT</name>
              <description>desc ADDR32BIT</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SSCLRRQ</name>
              <description>desc SSCLRRQ</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <description>desc EXTI</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40010400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TAMPER</name>
        <description>Tamper Interrupt</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>EXTI0</name>
        <description>EXTI Line0 Interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTI1</name>
        <description>EXTI Line1 Interrupt</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>EXTI2</name>
        <description>EXTI Line2 Interrupt</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>EXTI3</name>
        <description>EXTI Line3 Interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>EXTI4</name>
        <description>EXTI Line4 Interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>EXTI9_5</name>
        <description>External Line[9:5] Interrupts</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>EXTI15_10</name>
        <description>External Line[15:10] Interrupts</description>
        <value>40</value>
      </interrupt>
      <registers>
        <register>
          <name>IMR</name>
          <description>desc IMR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>MR</name>
              <description>desc MR</description>
              <msb>18</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR</name>
          <description>desc EMR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>MR</name>
              <description>desc MR</description>
              <msb>18</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSR</name>
          <description>desc RTSR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>TR</name>
              <description>desc TR</description>
              <msb>18</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR</name>
          <description>desc FTSR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>TR</name>
              <description>desc TR</description>
              <msb>18</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER</name>
          <description>desc SWIER</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>SWIER</name>
              <description>desc SWIER</description>
              <msb>18</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>desc PR</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FFFF</resetMask>
          <fields>
            <field>
              <name>PR</name>
              <description>desc PR</description>
              <msb>18</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
