py32-rs/py32-data/svd/PY32F303xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <description>desc SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40003800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI3</name>
      <description>desc SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40003C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SPI3</name>
        <description>SPI3 global Interrupt</description>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>desc SYSCFG</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <description>desc CFGR1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF0000</resetValue>
          <resetMask>0xFF0003</resetMask>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>desc MEM_MODE</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_PB5</name>
              <description>desc I2C_PB5</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_PB6</name>
              <description>desc I2C_PB6</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_PB7</name>
              <description>desc I2C_PB7</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_PB8</name>
              <description>desc I2C_PB8</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_PB9</name>
              <description>desc I2C_PB9</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_PB10</name>
              <description>desc I2C_PB10</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_PB11</name>
              <description>desc I2C_PB11</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_PB12</name>
              <description>desc I2C_PB12</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>desc CFGR2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0x5</resetMask>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>desc LOCKUP_LOCK</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PVD_LOCK</name>
              <description>desc PVD_LOCK</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_ETRGINJ_REMAP</name>
              <description>desc ADC1_ETRGINJ_REMAP</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1_ETRGREG_REMAP</name>
              <description>desc ADC1_ETRGREG_REMAP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_ETRGINJ_REMAP</name>
              <description>desc ADC2_ETRGINJ_REMAP</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2_ETRGREG_REMAP</name>
              <description>desc ADC2_ETRGREG_REMAP</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <description>desc CFGR3</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA1_MAP</name>
              <description>desc DMA1_MAP</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2_MAP</name>
              <description>desc DMA2_MAP</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA3_MAP</name>
              <description>desc DMA3_MAP</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA4_MAP</name>
              <description>desc DMA4_MAP</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR4</name>
          <description>desc CFGR4</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA5_MAP</name>
              <description>desc DMA5_MAP</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA6_MAP</name>
              <description>desc DMA6_MAP</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA7_MAP</name>
              <description>desc DMA7_MAP</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA8_MAP</name>
              <description>desc DMA8_MAP</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR5</name>
          <description>desc CFGR5</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA9_MAP</name>
              <description>desc DMA9_MAP</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA10_MAP</name>
              <description>desc DMA10_MAP</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA11_MAP</name>
              <description>desc DMA11_MAP</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA12_MAP</name>
              <description>desc DMA12_MAP</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <description>desc EXTICR1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>desc EXTI0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI1</name>
              <description>desc EXTI1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI2</name>
              <description>desc EXTI2</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI3</name>
              <description>desc EXTI3</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <description>desc EXTICR2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>desc EXTI4</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI5</name>
              <description>desc EXTI5</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI6</name>
              <description>desc EXTI6</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI7</name>
              <description>desc EXTI7</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR3</name>
          <description>desc EXTICR3</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI8</name>
              <description>desc EXTI8</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI9</name>
              <description>desc EXTI9</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI10</name>
              <description>desc EXTI10</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI11</name>
              <description>desc EXTI11</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR4</name>
          <description>desc EXTICR4</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>EXTI2</name>
              <description>desc EXTI2</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI3</name>
              <description>desc EXTI3</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI4</name>
              <description>desc EXTI4</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTI5</name>
              <description>desc EXTI5</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAENS</name>
          <description>desc PAENS</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PA_ENS</name>
              <description>desc PA_ENS</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PBENS</name>
          <description>desc PBENS</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PB_ENS</name>
              <description>desc PB_ENS</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCENS</name>
          <description>desc PCENS</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PC_ENS</name>
              <description>desc PC_ENS</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDENS</name>
          <description>desc PDENS</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PD_ENS</name>
              <description>desc PD_ENS</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PEENS</name>
          <description>desc PEENS</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PE_ENS</name>
              <description>desc PE_ENS</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOENA</name>
          <description>desc GPIOENA</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F03FF</resetMask>
          <fields>
            <field>
              <name>PA_ENA</name>
              <description>desc PA_ENA</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PB_ENA</name>
              <description>desc PB_ENA</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PC_ENA</name>
              <description>desc PC_ENA</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIM_CLK_EXT</name>
          <description>desc GPIOENA</description>
          <addressOffset>0x17C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F03FF</resetMask>
          <fields>
            <field>
              <name>TIM_PCLK1_SEL</name>
              <description>desc TIM_PCLK1_SEL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM_PCLK2_SEL</name>
              <description>desc TIM_PCLK2_SEL</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
